In [20]:
import pandas as pd
import numpy as np

In [36]:
df = pd.read_json (r'data.json')

In [28]:
adr=df.iloc[0,1].split(',')
adr1=x[0]
hausnr=[int(s) for s in adr1.split() if s.isdigit()]
strasse=''.join([i for i in w if not i.isdigit()])
plz=x[1]
plz=[int(s) for s in plz.split() if s.isdigit()]

In [38]:
df = pd.DataFrame.from_records(df.iloc[:,0])
df

    gültig von  gültig bis EUR je m²
0   01.04.2019                  4,62
1   01.04.2017  31.03.2019      4,16
2   01.04.2014  31.03.2017      3,04
3   01.04.2012  31.03.2014      1,93
4   01.04.2010  31.03.2012      1,32
5   01.04.2008  31.03.2010      1,35
6   01.04.2007  31.03.2008      1,37
7   01.04.2006  31.03.2007      0,00
8   01.03.2005  31.03.2006      0,00
9   01.04.2004  28.02.2005      0,00
10  01.04.2003  31.03.2004      0,00
11  01.04.2002  31.03.2003      0,00
12  01.01.2002  31.03.2002      0,00
13  01.04.2001  31.12.2001      0,00
14  01.04.2000  31.03.2001      0,00
15  01.04.1999  31.03.2000      0,00
16  01.04.1998  31.03.1999      0,00
17  01.04.1997  31.03.1998      0,00
18  01.04.1996  31.03.1997      0,00
19  01.04.1995  31.03.1996      0,00
20  01.03.1994  31.03.1995      0,00

In [42]:
alt = float(df.iloc[1,2].replace(',','.'))
neu = float(df.iloc[0,2].replace(',','.'))
alt, neu

(4.16, 4.62)

In [46]:
df1 = pd.DataFrame({'PLZ' : plz, 'Strasse' : strasse, 'Hausnummer' : hausnr, 'Zuschlag_bis_0319' : alt,'Zuschlag_seit_0419' : neu, 'Differenz' : round(neu - alt, 2)})
df1

,PLZ,Strasse,Hausnummer,Zuschlag_bis_0319,Zuschlag_seit_0419,Differenz
0,1060,Gumpendorfer Straße,12,4.16,4.62,0.46

In [47]:
df1.to_csv('zuschlag.csv', index=False)